Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/runsc/tomcat/target_count_8/repeat_26/7.txt
2020/02/06 17:25:49 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8007/
2020/02/06 17:26:19 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 21404 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8007
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.001 seconds
Complete requests:      21404
Failed requests:        0
Non-2xx responses:      21404
Total transferred:      18578672 bytes
HTML transferred:       15261052 bytes
Requests per second:    713.45 [#/sec] (mean)
Time per request:       140.165 [ms] (mean)
Time per request:       1.402 [ms] (mean, across all concurrent requests)
Transfer rate:          604.76 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  15.8      3    1001
Processing:     1  133  94.8    121    1095
Waiting:        0  130  88.2    120    1095
Total:          1  138  95.9    127    1099
Percentage of the requests served within a certain time (ms)
  50%    127
  66%    170
  75%    200
  80%    215
  90%    248
  95%    283
  98%    336
  99%    378
 100%   1099 (longest request)
2020/02/06 17:26:19 Matched stat line [Connect:        0    5  15.8      3    1001 Connect 0 5 15.8 3 1001]
2020/02/06 17:26:19 Matched stat line [Processing:     1  133  94.8    121    1095 Processing 1 133 94.8 121 1095]
2020/02/06 17:26:19 Matched stat line [Waiting:        0  130  88.2    120    1095 Waiting 0 130 88.2 120 1095]
2020/02/06 17:26:19 Matched stat line [Total:          1  138  95.9    127    1099 Total 1 138 95.9 127 1099]
2020/02/06 17:26:19 Matched percentline [  50%    127 50 127]
2020/02/06 17:26:19 Matched percentline [  66%    170 66 170]
2020/02/06 17:26:19 Matched percentline [  75%    200 75 200]
2020/02/06 17:26:19 Matched percentline [  80%    215 80 215]
2020/02/06 17:26:19 Matched percentline [  90%    248 90 248]
2020/02/06 17:26:19 Matched percentline [  95%    283 95 283]
2020/02/06 17:26:19 Matched percentline [  98%    336 98 336]
2020/02/06 17:26:19 Matched percentline [  99%    378 99 378]
2020/02/06 17:26:19 Matched percentline [ 100%   1099 100 1099]
{"connect":{"max":1001,"mean":5,"median":3,"min":0,"stdDev":15.800000190734863},"percentiles":{"100":1099,"50":127,"66":170,"75":200,"80":215,"90":248,"95":283,"98":336,"99":378},"processing":{"max":1095,"mean":133,"median":121,"min":1,"stdDev":94.80000305175781},"total":{"max":1099,"mean":138,"median":127,"min":1,"stdDev":95.9000015258789},"waiting":{"max":1095,"mean":130,"median":120,"min":0,"stdDev":88.19999694824219}}